Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD21_DFP/3.4.116/Microchip.SAMD21_DFP.pdsc
         <device Dname="ATSAMD21E16L">
            <processor Dcore="Cortex-M0+" Dendian="Little-endian" Dmpu="NO_MPU" Dfpu="NO_FPU"/>
            <compile header="samd21l/include/sam.h" define="__SAMD21E16L__"/>
            <debug svd="samd21l/svd/ATSAMD21E16L.svd"/>
            <memory id="IROM1" start="0x00000000" size="0x10000" default="1" startup="1"/>
            <memory id="IROM2" start="0x00400000" size="0x800"/>
            <memory id="IRAM1" start="0x20000000" size="0x2000" default="1"/>
            <algorithm name="samd21l/keil/Flash/ATSAMD21_64.FLM" start="0x00000000" size="0x00010000" default="1"/>
            <algorithm name="samd21l/keil/Flash/ATSAMD21_64_EEPROM.FLM" start="0x00400000" size="0x00000800" default="1"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension" schemaVersion="1.0">
                  <at:atdf name="samd21l/atdf/ATSAMD21E16L.atdf"/>
                  <at:variant ordercode="SAMD21E16L-MN" vccmin="1.62" vccmax="3.63" tempmin="-40" tempmax="105"/>
                  <at:variant ordercode="SAMD21E16L-MF" vccmin="1.62" vccmax="3.63" tempmin="-40" tempmax="125"/>
                  <at:variant ordercode="SAMD21E16L-AN" vccmin="1.62" vccmax="3.63" tempmin="-40" tempmax="105"/>
                  <at:variant ordercode="SAMD21E16L-AF" vccmin="1.62" vccmax="3.63" tempmin="-40" tempmax="125"/>
                  <at:memory name="FLASH" start="0x00000000" size="0x10000" type="flash" pagesize="64" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="AUX0" start="0x00804000" size="0x100" type="fuses" pagesize="64" rw="RW" address-space="base"/>
                  <at:memory name="AUX1" start="0x00806000" size="0x100" type="fuses" pagesize="64" rw="RW" address-space="base"/>
                  <at:memory name="AUX3" start="0x0080A000" size="0x100" type="fuses" pagesize="64" rw="RW" address-space="base"/>
                  <at:memory name="OTP1" start="0x00806000" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="OTP2" start="0x00806008" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="OTP4" start="0x00806020" size="0xE0" type="fuses" pagesize="64" rw="RW" address-space="base"/>
                  <at:memory name="TEMP_LOG" start="0x00806030" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="USER_PAGE" start="0x00804000" size="0x100" type="user_page" pagesize="64" rw="RW" address-space="base"/>
                  <at:memory name="RWW" start="0x00400000" size="0x800" type="flash" pagesize="64" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="HMCRAMC0" start="0x20000000" size="0x2000" type="ram" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="HPB0" start="0x40000000" size="0x10000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="HPB1" start="0x41000000" size="0x10000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="HPB2" start="0x42000000" size="0x10000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="PPB" start="0xE0000000" size="0x100000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="SCS" start="0xE000E000" size="0x00001000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io" rw="RW" address-space="base"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension" schemaVersion="1.0">
                  <mchp:pic name="samd21l/edc/ATSAMD21E16L.PIC"/>
                  <mchp:xc32 name="samd21l/xc32"/>
                  <mchp:hwtool type="mplab.mpheader">
                     <mchp:file name="samd21l/hwtools/mplab/MPHeader.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.pluginboardsupport">
                     <mchp:file name="samd21l/hwtools/mplab/PluginBoardSupport.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="sdm">
                     <mchp:file name="samd21l/hwtools/sdm/sdmDebuggerMap.xml"/>
                     <mchp:file name="samd21l/hwtools/sdm/sdmICD3.xml"/>
                     <mchp:file name="samd21l/hwtools/sdm/sdmRealICE.xml"/>
                     <mchp:file name="samd21l/hwtools/sdm/sdmSimulator.xml"/>
                     <mchp:file name="samd21l/hwtools/sdm/sdmICD4.xml"/>
                     <mchp:file name="samd21l/hwtools/sdm/sdmCompilers.xml"/>
                     <mchp:file name="samd21l/hwtools/sdm/sdmRealICE4.xml"/>
                     <mchp:file name="samd21l/hwtools/sdm/sdmICE4.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="persfr.arm32">
                     <mchp:file name="samd21l/hwtools/persfr/arm32.persfr"/>
                  </mchp:hwtool>
                  <mchp:prerequisite component="MPLAB X IDE" version="[5.20-"/>
               </mchp:extension>
            </environment>
            <description>ARM Cortex-M0+ -based MCU with 64KB Flash, 8KB SRAM, 48 MHz, four 16-bit timer/counters and two 24-bit Timer/Counters, DMA, 5 SERCOMs, 14-channel 12-bit ADC, 10-bit DAC, four ACs, 32 pins. It is optimized for lighting, motor control and other control applications</description>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATSAMD21E16L" title="Device page for ATSAMD21E16L"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATSAMD21E16L" title="Datasheet"/>
         </device>
