Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD21_DFP/3.4.116/Microchip.SAMD21_DFP.pdsc
      <condition id="ATSAMD21G15A">
         <require Dvendor="Microchip:3" Dname="ATSAMD21G15A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21G15B">
         <require Dvendor="Microchip:3" Dname="ATSAMD21G15B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21E16L">
         <require Dvendor="Microchip:3" Dname="ATSAMD21E16L"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21G15L">
         <require Dvendor="Microchip:3" Dname="ATSAMD21G15L"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21E16B">
         <require Dvendor="Microchip:3" Dname="ATSAMD21E16B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21E16A">
         <require Dvendor="Microchip:3" Dname="ATSAMD21E16A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21G17L">
         <require Dvendor="Microchip:3" Dname="ATSAMD21G17L"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21E16BU">
         <require Dvendor="Microchip:3" Dname="ATSAMD21E16BU"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21E17DU">
         <require Dvendor="Microchip:3" Dname="ATSAMD21E17DU"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21E17L">
         <require Dvendor="Microchip:3" Dname="ATSAMD21E17L"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21G17D">
         <require Dvendor="Microchip:3" Dname="ATSAMD21G17D"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21J15A">
         <require Dvendor="Microchip:3" Dname="ATSAMD21J15A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21G18A">
         <require Dvendor="Microchip:3" Dname="ATSAMD21G18A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21G17AU">
         <require Dvendor="Microchip:3" Dname="ATSAMD21G17AU"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21J17D">
         <require Dvendor="Microchip:3" Dname="ATSAMD21J17D"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21J17A">
         <require Dvendor="Microchip:3" Dname="ATSAMD21J17A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21E15CU">
         <require Dvendor="Microchip:3" Dname="ATSAMD21E15CU"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21E15B">
         <require Dvendor="Microchip:3" Dname="ATSAMD21E15B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21E15A">
         <require Dvendor="Microchip:3" Dname="ATSAMD21E15A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21E17A">
         <require Dvendor="Microchip:3" Dname="ATSAMD21E17A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21E15L">
         <require Dvendor="Microchip:3" Dname="ATSAMD21E15L"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21E17D">
         <require Dvendor="Microchip:3" Dname="ATSAMD21E17D"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21J15B">
         <require Dvendor="Microchip:3" Dname="ATSAMD21J15B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21G16L">
         <require Dvendor="Microchip:3" Dname="ATSAMD21G16L"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21E16CU">
         <require Dvendor="Microchip:3" Dname="ATSAMD21E16CU"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21G16A">
         <require Dvendor="Microchip:3" Dname="ATSAMD21G16A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21G16B">
         <require Dvendor="Microchip:3" Dname="ATSAMD21G16B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21J16B">
         <require Dvendor="Microchip:3" Dname="ATSAMD21J16B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21G18AU">
         <require Dvendor="Microchip:3" Dname="ATSAMD21G18AU"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21J16A">
         <require Dvendor="Microchip:3" Dname="ATSAMD21J16A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21E18A">
         <require Dvendor="Microchip:3" Dname="ATSAMD21E18A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21J18A">
         <require Dvendor="Microchip:3" Dname="ATSAMD21J18A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.4.0" condition="ATSAMD21E15BU">
         <description>Headers and startup code for Microchip ATSAMD21E15BU</description>
         <files>
            <file condition="C" category="include" name="samd21b/include/"/>
            <file condition="C" category="header" name="samd21b/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd21b/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd21b/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd21b/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd21b/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd21b/gcc/gcc/startup_samd21e15bu.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd21b/gcc/system_samd21e15bu.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd21b/gcc/gcc/samd21e15bu_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd21b/gcc/gcc/samd21e15bu_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21b/armcc/armcc/startup_samd21e15bu.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21b/armcc/system_samd21e15bu.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21b/iar/iar/startup_samd21e15bu.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21b/iar/system_samd21e15bu.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd21b/iar/iar/samd21e15bu_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd21b/iar/iar/samd21e15bu_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.4.0" condition="ATSAMD21G17A">
         <description>Headers and startup code for Microchip ATSAMD21G17A</description>
         <files>
            <file condition="C" category="include" name="samd21a/include/"/>
            <file condition="C" category="header" name="samd21a/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd21a/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd21a/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd21a/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd21a/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd21a/gcc/gcc/startup_samd21g17a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd21a/gcc/system_samd21g17a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd21a/gcc/gcc/samd21g17a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd21a/gcc/gcc/samd21g17a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21a/armcc/armcc/startup_samd21g17a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21a/armcc/system_samd21g17a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21a/iar/iar/startup_samd21g17a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21a/iar/system_samd21g17a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd21a/iar/iar/samd21g17a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd21a/iar/iar/samd21g17a_sram.icf" attr="config"/>
         </files>
      </component>
