Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD21_DFP/3.4.116/Microchip.SAMD21_DFP.pdsc
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.4.0" condition="ATSAMD21G15A">
         <description>Headers and startup code for Microchip ATSAMD21G15A</description>
         <files>
            <file condition="C" category="include" name="samd21a/include/"/>
            <file condition="C" category="header" name="samd21a/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd21a/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd21a/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd21a/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd21a/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd21a/gcc/gcc/startup_samd21g15a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd21a/gcc/system_samd21g15a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd21a/gcc/gcc/samd21g15a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd21a/gcc/gcc/samd21g15a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21a/armcc/armcc/startup_samd21g15a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21a/armcc/system_samd21g15a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21a/iar/iar/startup_samd21g15a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21a/iar/system_samd21g15a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd21a/iar/iar/samd21g15a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd21a/iar/iar/samd21g15a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.4.0" condition="ATSAMD21G15B">
         <description>Headers and startup code for Microchip ATSAMD21G15B</description>
         <files>
            <file condition="C" category="include" name="samd21b/include/"/>
            <file condition="C" category="header" name="samd21b/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd21b/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd21b/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd21b/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd21b/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd21b/gcc/gcc/startup_samd21g15b.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd21b/gcc/system_samd21g15b.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd21b/gcc/gcc/samd21g15b_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd21b/gcc/gcc/samd21g15b_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21b/armcc/armcc/startup_samd21g15b.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21b/armcc/system_samd21g15b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21b/iar/iar/startup_samd21g15b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21b/iar/system_samd21g15b.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd21b/iar/iar/samd21g15b_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd21b/iar/iar/samd21g15b_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.4.0" condition="ATSAMD21E16L">
         <description>Headers and startup code for Microchip ATSAMD21E16L</description>
         <files>
            <file condition="C" category="include" name="samd21l/include/"/>
            <file condition="C" category="header" name="samd21l/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd21l/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd21l/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd21l/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd21l/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd21l/gcc/gcc/startup_samd21e16l.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd21l/gcc/system_samd21e16l.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd21l/gcc/gcc/samd21e16l_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd21l/gcc/gcc/samd21e16l_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21l/armcc/armcc/startup_samd21e16l.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21l/armcc/system_samd21e16l.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21l/iar/iar/startup_samd21e16l.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21l/iar/system_samd21e16l.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd21l/iar/iar/samd21e16l_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd21l/iar/iar/samd21e16l_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.4.0" condition="ATSAMD21G15L">
         <description>Headers and startup code for Microchip ATSAMD21G15L</description>
         <files>
            <file condition="C" category="include" name="samd21l/include/"/>
            <file condition="C" category="header" name="samd21l/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd21l/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd21l/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd21l/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd21l/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd21l/gcc/gcc/startup_samd21g15l.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd21l/gcc/system_samd21g15l.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd21l/gcc/gcc/samd21g15l_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd21l/gcc/gcc/samd21g15l_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21l/armcc/armcc/startup_samd21g15l.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21l/armcc/system_samd21g15l.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21l/iar/iar/startup_samd21g15l.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21l/iar/system_samd21g15l.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd21l/iar/iar/samd21g15l_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd21l/iar/iar/samd21g15l_sram.icf" attr="config"/>
         </files>
      </component>
