Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD21_DFP/3.4.116/Microchip.SAMD21_DFP.pdsc
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.4.0" condition="ATSAMD21E16B">
         <description>Headers and startup code for Microchip ATSAMD21E16B</description>
         <files>
            <file condition="C" category="include" name="samd21b/include/"/>
            <file condition="C" category="header" name="samd21b/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd21b/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd21b/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd21b/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd21b/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd21b/gcc/gcc/startup_samd21e16b.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd21b/gcc/system_samd21e16b.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd21b/gcc/gcc/samd21e16b_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd21b/gcc/gcc/samd21e16b_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21b/armcc/armcc/startup_samd21e16b.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21b/armcc/system_samd21e16b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21b/iar/iar/startup_samd21e16b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21b/iar/system_samd21e16b.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd21b/iar/iar/samd21e16b_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd21b/iar/iar/samd21e16b_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.4.0" condition="ATSAMD21E16A">
         <description>Headers and startup code for Microchip ATSAMD21E16A</description>
         <files>
            <file condition="C" category="include" name="samd21a/include/"/>
            <file condition="C" category="header" name="samd21a/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd21a/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd21a/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd21a/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd21a/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd21a/gcc/gcc/startup_samd21e16a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd21a/gcc/system_samd21e16a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd21a/gcc/gcc/samd21e16a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd21a/gcc/gcc/samd21e16a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21a/armcc/armcc/startup_samd21e16a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21a/armcc/system_samd21e16a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21a/iar/iar/startup_samd21e16a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21a/iar/system_samd21e16a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd21a/iar/iar/samd21e16a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd21a/iar/iar/samd21e16a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.4.0" condition="ATSAMD21G17L">
         <description>Headers and startup code for Microchip ATSAMD21G17L</description>
         <files>
            <file condition="C" category="include" name="samd21l/include/"/>
            <file condition="C" category="header" name="samd21l/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd21l/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd21l/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd21l/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd21l/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd21l/gcc/gcc/startup_samd21g17l.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd21l/gcc/system_samd21g17l.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd21l/gcc/gcc/samd21g17l_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd21l/gcc/gcc/samd21g17l_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21l/armcc/armcc/startup_samd21g17l.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21l/armcc/system_samd21g17l.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21l/iar/iar/startup_samd21g17l.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21l/iar/system_samd21g17l.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd21l/iar/iar/samd21g17l_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd21l/iar/iar/samd21g17l_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.4.0" condition="ATSAMD21E16BU">
         <description>Headers and startup code for Microchip ATSAMD21E16BU</description>
         <files>
            <file condition="C" category="include" name="samd21b/include/"/>
            <file condition="C" category="header" name="samd21b/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd21b/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd21b/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd21b/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd21b/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd21b/gcc/gcc/startup_samd21e16bu.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd21b/gcc/system_samd21e16bu.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd21b/gcc/gcc/samd21e16bu_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd21b/gcc/gcc/samd21e16bu_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21b/armcc/armcc/startup_samd21e16bu.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21b/armcc/system_samd21e16bu.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21b/iar/iar/startup_samd21e16bu.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21b/iar/system_samd21e16bu.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd21b/iar/iar/samd21e16bu_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd21b/iar/iar/samd21e16bu_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.4.0" condition="ATSAMD21E17DU">
         <description>Headers and startup code for Microchip ATSAMD21E17DU</description>
         <files>
            <file condition="C" category="include" name="samd21d/include/"/>
            <file condition="C" category="header" name="samd21d/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd21d/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd21d/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd21d/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd21d/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd21d/gcc/gcc/startup_samd21e17du.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd21d/gcc/system_samd21e17du.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd21d/gcc/gcc/samd21e17du_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd21d/gcc/gcc/samd21e17du_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21d/armcc/armcc/startup_samd21e17du.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21d/armcc/system_samd21e17du.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21d/iar/iar/startup_samd21e17du.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21d/iar/system_samd21e17du.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd21d/iar/iar/samd21e17du_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd21d/iar/iar/samd21e17du_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.4.0" condition="ATSAMD21E17L">
         <description>Headers and startup code for Microchip ATSAMD21E17L</description>
         <files>
            <file condition="C" category="include" name="samd21l/include/"/>
            <file condition="C" category="header" name="samd21l/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd21l/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd21l/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd21l/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd21l/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd21l/gcc/gcc/startup_samd21e17l.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd21l/gcc/system_samd21e17l.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd21l/gcc/gcc/samd21e17l_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd21l/gcc/gcc/samd21e17l_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21l/armcc/armcc/startup_samd21e17l.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21l/armcc/system_samd21e17l.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21l/iar/iar/startup_samd21e17l.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21l/iar/system_samd21e17l.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd21l/iar/iar/samd21e17l_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd21l/iar/iar/samd21e17l_sram.icf" attr="config"/>
         </files>
      </component>
