Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD21_DFP/3.4.116/Microchip.SAMD21_DFP.pdsc
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.4.0" condition="ATSAMD21G17D">
         <description>Headers and startup code for Microchip ATSAMD21G17D</description>
         <files>
            <file condition="C" category="include" name="samd21d/include/"/>
            <file condition="C" category="header" name="samd21d/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd21d/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd21d/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd21d/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd21d/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd21d/gcc/gcc/startup_samd21g17d.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd21d/gcc/system_samd21g17d.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd21d/gcc/gcc/samd21g17d_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd21d/gcc/gcc/samd21g17d_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21d/armcc/armcc/startup_samd21g17d.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21d/armcc/system_samd21g17d.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21d/iar/iar/startup_samd21g17d.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21d/iar/system_samd21g17d.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd21d/iar/iar/samd21g17d_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd21d/iar/iar/samd21g17d_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.4.0" condition="ATSAMD21J15A">
         <description>Headers and startup code for Microchip ATSAMD21J15A</description>
         <files>
            <file condition="C" category="include" name="samd21a/include/"/>
            <file condition="C" category="header" name="samd21a/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd21a/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd21a/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd21a/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd21a/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd21a/gcc/gcc/startup_samd21j15a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd21a/gcc/system_samd21j15a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd21a/gcc/gcc/samd21j15a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd21a/gcc/gcc/samd21j15a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21a/armcc/armcc/startup_samd21j15a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21a/armcc/system_samd21j15a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21a/iar/iar/startup_samd21j15a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21a/iar/system_samd21j15a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd21a/iar/iar/samd21j15a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd21a/iar/iar/samd21j15a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.4.0" condition="ATSAMD21G18A">
         <description>Headers and startup code for Microchip ATSAMD21G18A</description>
         <files>
            <file condition="C" category="include" name="samd21a/include/"/>
            <file condition="C" category="header" name="samd21a/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd21a/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd21a/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd21a/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd21a/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd21a/gcc/gcc/startup_samd21g18a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd21a/gcc/system_samd21g18a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd21a/gcc/gcc/samd21g18a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd21a/gcc/gcc/samd21g18a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21a/armcc/armcc/startup_samd21g18a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21a/armcc/system_samd21g18a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21a/iar/iar/startup_samd21g18a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21a/iar/system_samd21g18a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd21a/iar/iar/samd21g18a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd21a/iar/iar/samd21g18a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.4.0" condition="ATSAMD21G17AU">
         <description>Headers and startup code for Microchip ATSAMD21G17AU</description>
         <files>
            <file condition="C" category="include" name="samd21a/include/"/>
            <file condition="C" category="header" name="samd21a/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd21a/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd21a/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd21a/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd21a/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd21a/gcc/gcc/startup_samd21g17au.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd21a/gcc/system_samd21g17au.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd21a/gcc/gcc/samd21g17au_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd21a/gcc/gcc/samd21g17au_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21a/armcc/armcc/startup_samd21g17au.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21a/armcc/system_samd21g17au.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21a/iar/iar/startup_samd21g17au.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21a/iar/system_samd21g17au.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd21a/iar/iar/samd21g17au_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd21a/iar/iar/samd21g17au_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.4.0" condition="ATSAMD21J17D">
         <description>Headers and startup code for Microchip ATSAMD21J17D</description>
         <files>
            <file condition="C" category="include" name="samd21d/include/"/>
            <file condition="C" category="header" name="samd21d/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd21d/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd21d/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd21d/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd21d/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd21d/gcc/gcc/startup_samd21j17d.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd21d/gcc/system_samd21j17d.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd21d/gcc/gcc/samd21j17d_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd21d/gcc/gcc/samd21j17d_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21d/armcc/armcc/startup_samd21j17d.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21d/armcc/system_samd21j17d.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21d/iar/iar/startup_samd21j17d.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21d/iar/system_samd21j17d.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd21d/iar/iar/samd21j17d_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd21d/iar/iar/samd21j17d_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.4.0" condition="ATSAMD21J17A">
         <description>Headers and startup code for Microchip ATSAMD21J17A</description>
         <files>
            <file condition="C" category="include" name="samd21a/include/"/>
            <file condition="C" category="header" name="samd21a/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd21a/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd21a/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd21a/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd21a/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd21a/gcc/gcc/startup_samd21j17a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd21a/gcc/system_samd21j17a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd21a/gcc/gcc/samd21j17a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd21a/gcc/gcc/samd21j17a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21a/armcc/armcc/startup_samd21j17a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21a/armcc/system_samd21j17a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21a/iar/iar/startup_samd21j17a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21a/iar/system_samd21j17a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd21a/iar/iar/samd21j17a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd21a/iar/iar/samd21j17a_sram.icf" attr="config"/>
         </files>
      </component>
