Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD21_DFP/3.4.116/Microchip.SAMD21_DFP.pdsc
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.4.0" condition="ATSAMD21E17A">
         <description>Headers and startup code for Microchip ATSAMD21E17A</description>
         <files>
            <file condition="C" category="include" name="samd21a/include/"/>
            <file condition="C" category="header" name="samd21a/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd21a/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd21a/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd21a/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd21a/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd21a/gcc/gcc/startup_samd21e17a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd21a/gcc/system_samd21e17a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd21a/gcc/gcc/samd21e17a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd21a/gcc/gcc/samd21e17a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21a/armcc/armcc/startup_samd21e17a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21a/armcc/system_samd21e17a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21a/iar/iar/startup_samd21e17a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21a/iar/system_samd21e17a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd21a/iar/iar/samd21e17a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd21a/iar/iar/samd21e17a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.4.0" condition="ATSAMD21E15L">
         <description>Headers and startup code for Microchip ATSAMD21E15L</description>
         <files>
            <file condition="C" category="include" name="samd21l/include/"/>
            <file condition="C" category="header" name="samd21l/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd21l/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd21l/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd21l/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd21l/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd21l/gcc/gcc/startup_samd21e15l.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd21l/gcc/system_samd21e15l.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd21l/gcc/gcc/samd21e15l_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd21l/gcc/gcc/samd21e15l_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21l/armcc/armcc/startup_samd21e15l.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21l/armcc/system_samd21e15l.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21l/iar/iar/startup_samd21e15l.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21l/iar/system_samd21e15l.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd21l/iar/iar/samd21e15l_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd21l/iar/iar/samd21e15l_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.4.0" condition="ATSAMD21E17D">
         <description>Headers and startup code for Microchip ATSAMD21E17D</description>
         <files>
            <file condition="C" category="include" name="samd21d/include/"/>
            <file condition="C" category="header" name="samd21d/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd21d/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd21d/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd21d/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd21d/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd21d/gcc/gcc/startup_samd21e17d.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd21d/gcc/system_samd21e17d.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd21d/gcc/gcc/samd21e17d_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd21d/gcc/gcc/samd21e17d_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21d/armcc/armcc/startup_samd21e17d.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21d/armcc/system_samd21e17d.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21d/iar/iar/startup_samd21e17d.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21d/iar/system_samd21e17d.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd21d/iar/iar/samd21e17d_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd21d/iar/iar/samd21e17d_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.4.0" condition="ATSAMD21J15B">
         <description>Headers and startup code for Microchip ATSAMD21J15B</description>
         <files>
            <file condition="C" category="include" name="samd21b/include/"/>
            <file condition="C" category="header" name="samd21b/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd21b/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd21b/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd21b/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd21b/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd21b/gcc/gcc/startup_samd21j15b.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd21b/gcc/system_samd21j15b.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd21b/gcc/gcc/samd21j15b_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd21b/gcc/gcc/samd21j15b_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21b/armcc/armcc/startup_samd21j15b.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21b/armcc/system_samd21j15b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21b/iar/iar/startup_samd21j15b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21b/iar/system_samd21j15b.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd21b/iar/iar/samd21j15b_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd21b/iar/iar/samd21j15b_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.4.0" condition="ATSAMD21G16L">
         <description>Headers and startup code for Microchip ATSAMD21G16L</description>
         <files>
            <file condition="C" category="include" name="samd21l/include/"/>
            <file condition="C" category="header" name="samd21l/include/sam.h"/>
            <file condition="C Exe" category="source" name="samd21l/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samd21l/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samd21l/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samd21l/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samd21l/gcc/gcc/startup_samd21g16l.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samd21l/gcc/system_samd21g16l.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samd21l/gcc/gcc/samd21g16l_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samd21l/gcc/gcc/samd21g16l_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21l/armcc/armcc/startup_samd21g16l.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samd21l/armcc/system_samd21g16l.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21l/iar/iar/startup_samd21g16l.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samd21l/iar/system_samd21g16l.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samd21l/iar/iar/samd21g16l_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samd21l/iar/iar/samd21g16l_sram.icf" attr="config"/>
         </files>
      </component>
